Revit 2027 API
ParameterTypeId.StructuralConnectionCodeCheckingStatus Property
 "Code Checking Status"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralConnectionCodeCheckingStatus { get; }
Public Shared ReadOnly Property StructuralConnectionCodeCheckingStatus As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralConnectionCodeCheckingStatus {
	ForgeTypeId^ get ();
}
static member StructuralConnectionCodeCheckingStatus : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace